ChartsOfCharacteristicTypes/Renault_ВопросыДляАнкетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>Renault_ВопросыДляАнкетирования</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Renault_ВариантыОтветовАнкет</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыОтветовНаВопрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрокТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолнаяФормулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгрегироватьСуммуВОтчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтветаНаВопрос</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтветаНаВопросАнкеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВесВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбязателенДляЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСекундОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КолонкиТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КолонкаТаблицы</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.Renault_ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Enums/Renault_ТипыОтветовНаВопрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыОтветовНаВопрос</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеИнформационнойБазы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидКонтактнойИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинВариантИз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НесколькоВариантовИз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCharacteristicTypes/Renault_ВопросыДляАнкетирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Не ТребуетсяКомментарий Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПояснениеКомментария");
	КонецЕсли;
	
	Если (ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.Строка)
		И (ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.Число) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Длина");
	КонецЕсли;
	Если ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.ЗначениеИнформационнойБазы Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипЗначения");
	КонецЕсли;
	Если ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.ВидКонтактнойИнформации Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформации");
	КонецЕсли;
	
	Renault_ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		ОчиститьНенужныеРеквизиты();
		УстановкаТипаПВХ();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура очищает значения ненужных реквизитов,
// Такая ситуация возникает, когда пользователь изменяет тип ответа при редактировании.
Процедура ОчиститьНенужныеРеквизиты()

	Если (ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.ВидКонтактнойИнформации)
	   И (НЕ ВидКонтактнойИнформации.Пустая()) Тогда
		
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
		
	КонецЕсли;
		
	Если ((ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.Число) И (ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.Строка)  И (ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.Текст))
	   И (Длина <> 0)Тогда
		
		Длина = 0;
		
	КонецЕсли;
	
	Если (ТипОтвета <> Перечисления.Renault_ТипыОтветовНаВопрос.Число) Тогда	
		
		МинимальноеЗначение       = 0;
		МаксимальноеЗначение      = 0;
		АгрегироватьСуммуВОтчетах = Ложь;
		
	КонецЕсли;
	
	Если ТипОтвета = Перечисления.Renault_ТипыОтветовНаВопрос.НесколькоВариантовИз Тогда
		ТребуетсяКомментарий = Ложь;
		ПояснениеКомментария = "";
	КонецЕсли;

КонецПроцедуры

//Устанавливает тип значения ПВХ в зависимости от типа ответа
Процедура УстановкаТипаПВХ()
	
	ТипыОтветовНаВопрос = Перечисления.Renault_ТипыОтветовНаВопрос;
	
	// Квалификаторы
	КЧ = Новый КвалификаторыЧисла(?(Длина = 0,15,Длина),Точность);
	КС = Новый КвалификаторыСтроки(Длина);
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	
	// Описание типов
	ОписаниеТиповЧисло  = Новый ОписаниеТипов("Число",,КЧ);
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , КС);
	ОписаниеТиповДата   = Новый ОписаниеТипов("Дата",КД , , );
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТиповВО     = Новый ОписаниеТипов("СправочникСсылка.Renault_ВариантыОтветовАнкет");
	
	Если ТипОтвета = ТипыОтветовНаВопрос.Строка Тогда
		
			ТипЗначения = ОписаниеТиповСтрока;
		
	ИначеЕсли ТипОтвета = ТипыОтветовНаВопрос.Текст Тогда
		
			ТипЗначения = ОписаниеТиповСтрока;
		
	ИначеЕсли ТипОтвета = ТипыОтветовНаВопрос.Число Тогда
		
			ТипЗначения = ОписаниеТиповЧисло;
		
	ИначеЕсли ТипОтвета = ТипыОтветовНаВопрос.Дата Тогда
		
			ТипЗначения = ОписаниеТиповДата;
		
	ИначеЕсли ТипОтвета = ТипыОтветовНаВопрос.Булево Тогда
		
			ТипЗначения = ОписаниеТиповБулево;
			
	ИначеЕсли ТипОтвета = ТипыОтветовНаВопрос.ВидКонтактнойИнформации Тогда
		
			ТипЗначения = ОписаниеТиповСтрока;
		
	ИначеЕсли ТипОтвета =ТипыОтветовНаВопрос.ОдинВариантИз
		  ИЛИ ТипОтвета = ТипыОтветовНаВопрос.НесколькоВариантовИз Тогда
		
			ТипЗначения = ОписаниеТиповВО;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли
